# SELECT

Antes de começar execute os comandos de configuração:

In [1]:
# NÃO ALTERE ESSA CÉLULA
# Carregando o módulo SQL
%load_ext sql
# Selecionando o Banco (no caso o SQLite)
%sql sqlite:///databases/universidade.db

_<span style="color:red">Atenção! Para possibilitar a execução dos comandos é necessário utilizar o comando mágico '%sql' ou '%%sql'.</span>_

### Observe o seguinte esquema de uma universidade:

<b>1. MODELO CONCEITUAL</b>

<img src='images/c006.png' style="float: left;" />

<b>2. CÓDIGOS SQL</b>
- <a href="./databases/DDLuniversidade.txt" target="_blank">DDL</a>
- <a href="./databases/DMLuniversidade.txt" target="_blank">DML</a>

 ### Com base no esquema apresentado acima, escreva o código SQL para recuperar as seguintes informações no bando de dados.

<b> A) </b> Todas as informações de todos os departamentos

_Resposta:_

In [2]:
%sql SELECT * FROM departamento;

 * sqlite:///databases/universidade.db
Done.

[('d001', 'Exatas', 1203, 'p023'),
 ('d002', 'Humanas', 1220, 'p0234'),
 ('d005', 'Computação', 1271, 'p025'),
 ('d009', 'Biológicas', 1339, 'p037')]

<b> B) </b> Número e título de todos os projetos

_Resposta:_

In [3]:
%sql SELECT projetoNumero, projetoTitulo FROM projeto;

 * sqlite:///databases/universidade.db
Done.

[(969, 'Projeto Biologia e sociedade'),
 (1248, 'Projeto Ciência exata e humana'),
 (1093, 'Projeto Ciências e a Cidade'),
 (1062, 'Projeto Computação Futuro'),
 (1000, 'Projeto Computação e atualidades'),
 (1310, 'Projeto Computação e natureza'),
 (938, 'Projeto Computação em sociedade'),
 (1279, 'Projeto Computação estatística'),
 (1186, 'Projeto Computação humana'),
 (1217, 'Projeto Computação para ensino de exatas'),
 (1031, 'Projeto Deitos Humanos Justos'),
 (876, 'Projeto Extatas para a sociedade'),
 (907, 'Projeto História em ação'),
 (1155, 'Projeto Humanos em ação'),
 (1124, 'Projeto Informática na zona rural')]

<b> C) </b> Nome e título dos professores com titulo de Mestre.

_Resposta:_

In [4]:
%%sql 
SELECT professorNome, professorTitulo
FROM professor
WHERE professorTitulo = 'Mestre'

 * sqlite:///databases/universidade.db
Done.

[('Aisha Vinhas Castelo', 'Mestre'),
 ('Abel Pestana Murtinho', 'Mestre'),
 ('Micael Delgado Adarga', 'Mestre'),
 ('Zion Coimbra Carqueijeiro', 'Mestre'),
 ('Sophia Malta Peralta', 'Mestre'),
 ('Mílton Barra Pires', 'Mestre')]

<b> D) </b> Nome e grau dos cursos que não são de graduação.

_Resposta:_

In [5]:
%%sql 
SELECT cursoNome, cursoGrau
FROM curso
WHERE cursoGrau <> 'Graduação'

 * sqlite:///databases/universidade.db
Done.

[('Estatística', 'Especialização'),
 ('Filosofia', 'Especialização'),
 ('Gestão ambiental', 'Especialização'),
 ('Tecnlogia da informação', 'Especialização'),
 ('Cência de dados', 'Mestrado'),
 ('Jogos digitais', 'Especialização')]

<b> E) </b> Titulo dos projetos que tiveram início no ano de 2018.

_Resposta:_

In [6]:
%%sql 
SELECT projetoTitulo, projetoDataInicio
FROM projeto
WHERE 
    projetoDataInicio >= '2018-01-01' AND 
    projetoDataInicio <= '2018-12-31'

 * sqlite:///databases/universidade.db
Done.

[('Projeto Biologia e sociedade', '2018-08-16'),
 ('Projeto Computação e atualidades', '2018-06-11'),
 ('Projeto Ciências e a Cidade', '2018-11-24'),
 ('Projeto Computação humana', '2018-05-09'),
 ('Projeto Computação para ensino de exatas', '2018-03-04'),
 ('Projeto Computação estatística', '2018-10-23')]

<b> F) </b>Titulo dos projetos com orçamento menor do que 5000 reais ou maior do que 20000 reais.

_Resposta:_

In [7]:
%%sql 
SELECT projetoTitulo, projetoOrcamento
FROM projeto
WHERE 
    projetoOrcamento < 5000 OR 
    projetoOrcamento > 20000

 * sqlite:///databases/universidade.db
Done.

[('Projeto Extatas para a sociedade', 4560.87),
 ('Projeto Deitos Humanos Justos', 23463.28),
 ('Projeto Ciências e a Cidade', 34839.41),
 ('Projeto Informática na zona rural', 22170.53),
 ('Projeto Humanos em ação', 3560.87),
 ('Projeto Ciência exata e humana', 3364.67)]

<b> G) </b> Nome dos estudantes que começam com a letra A

_Resposta:_

In [8]:
%%sql 
SELECT estudanteNome
FROM estudante
WHERE estudanteNome LIKE 'A%'

 * sqlite:///databases/universidade.db
Done.

[('Ayaan Barreira Varão',),
 ('Anaelle Espargosa Caeiro',),
 ('Ana Velasco Durão',),
 ('Alessandro Olaio Teodoro',),
 ('Ariele Parente Cascais',)]

<b> H) </b> Nome das áreas de pesquisa que contenham a palavra 'computação'.

_Resposta:_

In [9]:
%%sql 
SELECT *
FROM area_pesquisa
WHERE areaNome LIKE '%computação%'

 * sqlite:///databases/universidade.db
Done.

[('Teoria da Computação',),
 ('Matemática da Computação',),
 ('Metodologia e Técnicas da Computação',),
 ('Sistemas de Computação',)]